ScanReach/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/srt/cc1352p/CC1352P_MESHNODE.c
const ADC_Config ADC_config[CC1352P_MESHNODE_ADCCOUNT] = {
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADC0], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADC0]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADC1], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADC1]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADC2], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADC2]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADC3], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADC3]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADC4], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADC4]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADCDCOUPL], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADCDCOUPL]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADCVSS], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADCVSS]},
    {&ADCCC26XX_fxnTable, &adcCC26xxObjects[CC1352P_MESHNODE_ADCVDDS], &adcCC26xxHWAttrs[CC1352P_MESHNODE_ADCVDDS]},
};

const uint_least8_t ADC_count = CC1352P_MESHNODE_ADCCOUNT;

/*
 *  =============================== ECDH ===============================
 */
#include <ti/drivers/ECDH.h>
#include <ti/drivers/ecdh/ECDHCC26X2.h>

ECDHCC26X2_Object ecdhCC26X2Objects[CC1352P_MESHNODE_ECDHCOUNT];

const ECDHCC26X2_HWAttrs ecdhCC26X2HWAttrs[CC1352P_MESHNODE_ECDHCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const ECDH_Config ECDH_config[CC1352P_MESHNODE_ECDHCOUNT] = {
    {
         .object  = &ecdhCC26X2Objects[CC1352P_MESHNODE_ECDH0],
         .hwAttrs = &ecdhCC26X2HWAttrs[CC1352P_MESHNODE_ECDH0]
    },
};

const uint_least8_t ECDH_count = CC1352P_MESHNODE_ECDHCOUNT;

/*
 *  =============================== ECDSA ===============================
 */
#include <ti/drivers/ECDSA.h>
#include <ti/drivers/ecdsa/ECDSACC26X2.h>

ECDSACC26X2_Object ecdsaCC26X2Objects[CC1352P_MESHNODE_ECDSACOUNT];

const ECDSACC26X2_HWAttrs ecdsaCC26X2HWAttrs[CC1352P_MESHNODE_ECDSACOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const ECDSA_Config ECDSA_config[CC1352P_MESHNODE_ECDSACOUNT] = {
    {
         .object  = &ecdsaCC26X2Objects[CC1352P_MESHNODE_ECDSA0],
         .hwAttrs = &ecdsaCC26X2HWAttrs[CC1352P_MESHNODE_ECDSA0]
    },
};

const uint_least8_t ECDSA_count = CC1352P_MESHNODE_ECDSACOUNT;

/*
 *  =============================== ECJPAKE ===============================
 */
#include <ti/drivers/ECJPAKE.h>
#include <ti/drivers/ecjpake/ECJPAKECC26X2.h>

ECJPAKECC26X2_Object ecjpakeCC26X2Objects[CC1352P_MESHNODE_ECJPAKECOUNT];

const ECJPAKECC26X2_HWAttrs ecjpakeCC26X2HWAttrs[CC1352P_MESHNODE_ECJPAKECOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const ECJPAKE_Config ECJPAKE_config[CC1352P_MESHNODE_ECJPAKECOUNT] = {
    {
         .object  = &ecjpakeCC26X2Objects[CC1352P_MESHNODE_ECJPAKE0],
         .hwAttrs = &ecjpakeCC26X2HWAttrs[CC1352P_MESHNODE_ECJPAKE0]
    },
};

const uint_least8_t ECJPAKE_count = CC1352P_MESHNODE_ECJPAKECOUNT;


/*
 *  =============================== SHA2 ===============================
 */
#include <ti/drivers/SHA2.h>
#include <ti/drivers/sha2/SHA2CC26X2.h>

SHA2CC26X2_Object sha2CC26X2Objects[CC1352P_MESHNODE_SHA2COUNT];

const SHA2CC26X2_HWAttrs sha2CC26X2HWAttrs[CC1352P_MESHNODE_SHA2COUNT] = {
    {
        .intPriority       = ~0,
    }
};

const SHA2_Config SHA2_config[CC1352P_MESHNODE_SHA2COUNT] = {
    {
         .object  = &sha2CC26X2Objects[CC1352P_MESHNODE_SHA20],
         .hwAttrs = &sha2CC26X2HWAttrs[CC1352P_MESHNODE_SHA20]
    },
};

const uint_least8_t SHA2_count = CC1352P_MESHNODE_SHA2COUNT;

/*
 *  =============================== AESCCM ===============================
 */
#include <ti/drivers/AESCCM.h>
#include <ti/drivers/aesccm/AESCCMCC26XX.h>

AESCCMCC26XX_Object aesccmCC26XXObjects[CC1352P_MESHNODE_AESCCMCOUNT];

const AESCCMCC26XX_HWAttrs aesccmCC26XXHWAttrs[CC1352P_MESHNODE_AESCCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCCM_Config AESCCM_config[CC1352P_MESHNODE_AESCCMCOUNT] = {
    {
         .object  = &aesccmCC26XXObjects[CC1352P_MESHNODE_AESCCM0],
         .hwAttrs = &aesccmCC26XXHWAttrs[CC1352P_MESHNODE_AESCCM0]
    },
};

const uint_least8_t AESCCM_count = CC1352P_MESHNODE_AESCCMCOUNT;

/*
 *  =============================== AESGCM ===============================
 */
#include <ti/drivers/AESGCM.h>
#include <ti/drivers/aesgcm/AESGCMCC26XX.h>

AESGCMCC26XX_Object aesgcmCC26XXObjects[CC1352P_MESHNODE_AESGCMCOUNT];

const AESGCMCC26XX_HWAttrs aesgcmCC26XXHWAttrs[CC1352P_MESHNODE_AESGCMCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESGCM_Config AESGCM_config[CC1352P_MESHNODE_AESGCMCOUNT] = {
    {
         .object  = &aesgcmCC26XXObjects[CC1352P_MESHNODE_AESGCM0],
         .hwAttrs = &aesgcmCC26XXHWAttrs[CC1352P_MESHNODE_AESGCM0]
    },
};

const uint_least8_t AESGCM_count = CC1352P_MESHNODE_AESGCMCOUNT;

/*
 *  =============================== AESCBC ===============================
 */
#include <ti/drivers/AESCBC.h>
#include <ti/drivers/aescbc/AESCBCCC26XX.h>

AESCBCCC26XX_Object aescbcCC26XXObjects[CC1352P_MESHNODE_AESCBCCOUNT];

const AESCBCCC26XX_HWAttrs aescbcCC26XXHWAttrs[CC1352P_MESHNODE_AESCBCCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCBC_Config AESCBC_config[CC1352P_MESHNODE_AESCBCCOUNT] = {
    {
         .object  = &aescbcCC26XXObjects[CC1352P_MESHNODE_AESCBC0],
         .hwAttrs = &aescbcCC26XXHWAttrs[CC1352P_MESHNODE_AESCBC0]
    },
};

const uint_least8_t AESCBC_count = CC1352P_MESHNODE_AESCBCCOUNT;

/*
 *  =============================== AESCTR ===============================
 */
#include <ti/drivers/AESCTR.h>
#include <ti/drivers/aesctr/AESCTRCC26XX.h>

AESCTRCC26XX_Object aesctrCC26XXObjects[CC1352P_MESHNODE_AESCTRCOUNT];

const AESCTRCC26XX_HWAttrs aesctrCC26XXHWAttrs[CC1352P_MESHNODE_AESCTRCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESCTR_Config AESCTR_config[CC1352P_MESHNODE_AESCTRCOUNT] = {
    {
         .object  = &aesctrCC26XXObjects[CC1352P_MESHNODE_AESCTR0],
         .hwAttrs = &aesctrCC26XXHWAttrs[CC1352P_MESHNODE_AESCTR0]
    },
};

const uint_least8_t AESCTR_count = CC1352P_MESHNODE_AESCTRCOUNT;

