ScanReach/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/srt/cc1352p/CC1352P_MESHNODE.c
/*
 *  =============================== AESECB ===============================
 */
#include <ti/drivers/AESECB.h>
#include <ti/drivers/aesecb/AESECBCC26XX.h>

AESECBCC26XX_Object aesecbCC26XXObjects[CC1352P_MESHNODE_AESECBCOUNT];

const AESECBCC26XX_HWAttrs aesecbCC26XXHWAttrs[CC1352P_MESHNODE_AESECBCOUNT] = {
    {
        .intPriority       = ~0,
    }
};

const AESECB_Config AESECB_config[CC1352P_MESHNODE_AESECBCOUNT] = {
    {
         .object  = &aesecbCC26XXObjects[CC1352P_MESHNODE_AESECB0],
         .hwAttrs = &aesecbCC26XXHWAttrs[CC1352P_MESHNODE_AESECB0]
    },
};

const uint_least8_t AESECB_count = CC1352P_MESHNODE_AESECBCOUNT;

/*
 *  =============================== AESCTRDRBG ===============================
 */
#include <ti/drivers/AESCTRDRBG.h>
#include <ti/drivers/aesctrdrbg/AESCTRDRBGXX.h>

AESCTRDRBGXX_Object aesctrdrbgXXObjects[CC1352P_MESHNODE_AESCTRDRBGCOUNT];

const AESCTRDRBGXX_HWAttrs aesctrdrbgXXHWAttrs[CC1352P_MESHNODE_AESCTRDRBGCOUNT] = {
    {
        .aesctrIndex       = CC1352P_MESHNODE_AESCTR0,
    }
};

const AESCTRDRBG_Config AESCTRDRBG_config[CC1352P_MESHNODE_AESCTRDRBGCOUNT] = {
    {
         .object  = &aesctrdrbgXXObjects[CC1352P_MESHNODE_AESCTRDRBG0],
         .hwAttrs = &aesctrdrbgXXHWAttrs[CC1352P_MESHNODE_AESCTRDRBG0]
    },
};

const uint_least8_t AESCTRDRBG_count = CC1352P_MESHNODE_AESCTRDRBGCOUNT;

/*
 *  =============================== TRNG ===============================
 */
#include <ti/drivers/TRNG.h>
#include <ti/drivers/trng/TRNGCC26XX.h>

TRNGCC26XX_Object trngCC26XXObjects[CC1352P_MESHNODE_TRNGCOUNT];

const TRNGCC26XX_HWAttrs trngCC26X2HWAttrs[CC1352P_MESHNODE_TRNGCOUNT] = {
    {
        .intPriority       = ~0,
        .swiPriority       = 0,
        .samplesPerCycle   = 240000,
    }
};

const TRNG_Config TRNG_config[CC1352P_MESHNODE_TRNGCOUNT] = {
    {
         .object  = &trngCC26XXObjects[CC1352P_MESHNODE_TRNG0],
         .hwAttrs = &trngCC26X2HWAttrs[CC1352P_MESHNODE_TRNG0]
    },
};

const uint_least8_t TRNG_count = CC1352P_MESHNODE_TRNGCOUNT;

/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC26XX.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1352P_MESHNODE.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array. Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* Input pins */
    GPIOCC26XX_DIO_15 | GPIO_DO_NOT_CONFIG,  /* Button 0 */
    GPIOCC26XX_DIO_14 | GPIO_DO_NOT_CONFIG,  /* Button 1 */

    GPIOCC26XX_DIO_15 | GPIO_DO_NOT_CONFIG,  /* CC1352P_MESHNODE_SPI_MASTER_READY */
    GPIOCC26XX_DIO_21 | GPIO_DO_NOT_CONFIG,  /* CC1352P_MESHNODE_SPI_SLAVE_READY */

    /* Output pins */
    GPIOCC26XX_DIO_06 | GPIO_DO_NOT_CONFIG,  /* Green LED */
    GPIOCC26XX_DIO_05 | GPIO_DO_NOT_CONFIG,  /* Red LED */

    /* SPI Flash CSN */
    GPIOCC26XX_DIO_20 | GPIO_DO_NOT_CONFIG,

    /* SD CS
     * On CC1352P LaunchPads, the default LaunchPad header for SD CS is not
     * connected. DIO_14 is mapped to the alternate SD CS pin on the SHARP128
     * BoosterPack. To enable the alternate SD CS BoosterPack pin, you need to
     * remove the SHARP128 R16 and solder it onto the unpopulated R17 instead.
     * When using the SD CS in this manner, BTN-2 is unavaillable since they
     * both map to DIO_14.
     * Alternatively, you can jumper wire the following on the LaunchPad:
     * J1.8 to DIO14
     */
    GPIOCC26XX_DIO_14 | GPIO_DO_NOT_CONFIG,
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1352P_LAUNCH.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /* Button 0 */
    NULL,  /* Button 1 */
    NULL,  /* CC1352P_MESHNODE_SPI_MASTER_READY */
    NULL,  /* CC1352P_MESHNODE_SPI_SLAVE_READY */
};

const GPIOCC26XX_Config GPIOCC26XX_config = {
    .pinConfigs         = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks          = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = CC1352P_MESHNODE_GPIOCOUNT,
    .numberOfCallbacks  = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority        = (~0)
};

/*
 *  =============================== GPTimer ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/timer/GPTimerCC26XX.h>

GPTimerCC26XX_Object gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMERCOUNT];

const GPTimerCC26XX_HWAttrs gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMERPARTSCOUNT] = {
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0A, },
    { .baseAddr = GPT0_BASE, .intNum = INT_GPT0B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT0, .pinMux = GPT_PIN_0B, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1A, },
    { .baseAddr = GPT1_BASE, .intNum = INT_GPT1B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT1, .pinMux = GPT_PIN_1B, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2A, },
    { .baseAddr = GPT2_BASE, .intNum = INT_GPT2B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT2, .pinMux = GPT_PIN_2B, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3A, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3A, },
    { .baseAddr = GPT3_BASE, .intNum = INT_GPT3B, .intPriority = (~0), .powerMngrId = PowerCC26XX_PERIPH_GPT3, .pinMux = GPT_PIN_3B, },
};

const GPTimerCC26XX_Config GPTimerCC26XX_config[CC1352P_MESHNODE_GPTIMERPARTSCOUNT] = {
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER0], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER0A], GPT_A },
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER0], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER0B], GPT_B },
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER1], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER1A], GPT_A },
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER1], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER1B], GPT_B },
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER2], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER2A], GPT_A },
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER2], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER2B], GPT_B },
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER3], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER3A], GPT_A },
    { &gptimerCC26XXObjects[CC1352P_MESHNODE_GPTIMER3], &gptimerCC26xxHWAttrs[CC1352P_MESHNODE_GPTIMER3B], GPT_B },
};

