ScanReach/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/srt/cc1352p/CC1352P_MESHNODE.c
/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26X2.h>
#include "clock-arch.h"

const PowerCC26X2_Config PowerCC26X2_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &clock_arch_standby_policy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
    .calibrateRCOSC_LF  = true,
    .calibrateRCOSC_HF  = true,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWMCOUNT] = {
    { .pwmPin = CC1352P_MESHNODE_PWMPIN0, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER0A },
    { .pwmPin = CC1352P_MESHNODE_PWMPIN1, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER0B },
    { .pwmPin = CC1352P_MESHNODE_PWMPIN2, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER1A },
    { .pwmPin = CC1352P_MESHNODE_PWMPIN3, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER1B },
    { .pwmPin = CC1352P_MESHNODE_PWMPIN4, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER2A },
    { .pwmPin = CC1352P_MESHNODE_PWMPIN5, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER2B },
    { .pwmPin = CC1352P_MESHNODE_PWMPIN6, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER3A },
    { .pwmPin = CC1352P_MESHNODE_PWMPIN7, .gpTimerUnit = CC1352P_MESHNODE_GPTIMER3B },
};

const PWM_Config PWM_config[CC1352P_MESHNODE_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM0], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM1], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM2], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM3], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM4], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM5], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM6], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1352P_MESHNODE_PWM7], &pwmtimerCC26xxHWAttrs[CC1352P_MESHNODE_PWM7] },
};

const uint_least8_t PWM_count = CC1352P_MESHNODE_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

/*
 *  Board-specific callback function to set the correct antenna path.
 *
 *  This function is called by the RF driver on global driver events.
 *  It contains a default implementation to set the correct antenna path.
 *  This function is defined in the file CC1352P_MESHNODE_fxns.c
 */
extern void rfDriverCallback(RF_Handle client, RF_GlobalEvent events, void* arg);

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,     /* Lowest HWI priority */
    .swiPriority        = 0,      /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,   /* Keep XOSC dependency while in standby */

    /* Register the board specific callback */
    .globalCallback     = &rfDriverCallback,

    /* Subscribe the callback to both events */
    .globalEventMask    = RF_GlobalEventRadioSetup | RF_GlobalEventRadioPowerDown
};

/*
 *  =============================== SD ===============================
 */
#include <ti/drivers/SD.h>
#include <ti/drivers/sd/SDSPI.h>

#if TI_SD_CONF_ENABLE

#if !(TI_SPI_CONF_SPI0_ENABLE)
#error "SD driver requires SPI0 enabled"
#endif

SDSPI_Object sdspiObjects[CC1352P_MESHNODE_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC1352P_MESHNODE_SDCOUNT] = {
    {
        .spiIndex = CC1352P_MESHNODE_SPI0,
        .spiCsGpioIndex = CC1352P_MESHNODE_SDSPI_CS
    }
};

const SD_Config SD_config[CC1352P_MESHNODE_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC1352P_MESHNODE_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC1352P_MESHNODE_SDSPI0]
    },
};

const uint_least8_t SD_count = CC1352P_MESHNODE_SDCOUNT;

#endif /* TI_SD_CONF_ENABLE */

/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26X2DMA.h>

#if TI_SPI_CONF_ENABLE

SPICC26X2DMA_Object spiCC26X2DMAObjects[CC1352P_MESHNODE_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26X2DMA_HWAttrs spiCC26X2DMAHWAttrs[CC1352P_MESHNODE_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC1352P_MESHNODE_SPI0_MOSI,
        .misoPin            = CC1352P_MESHNODE_SPI0_MISO,
        .clkPin             = CC1352P_MESHNODE_SPI0_CLK,
        .csnPin             = CC1352P_MESHNODE_SPI0_CSN,
        .minDmaTransferSize = 10
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC1352P_MESHNODE_SPI1_MOSI,
        .misoPin            = CC1352P_MESHNODE_SPI1_MISO,
        .clkPin             = CC1352P_MESHNODE_SPI1_CLK,
        .csnPin             = CC1352P_MESHNODE_SPI1_CSN,
        .minDmaTransferSize = 10
    },
#endif
};

const SPI_Config SPI_config[CC1352P_MESHNODE_SPICOUNT] = {
#if TI_SPI_CONF_SPI0_ENABLE
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC1352P_MESHNODE_SPI0],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC1352P_MESHNODE_SPI0]
    },
#endif
#if TI_SPI_CONF_SPI1_ENABLE
    {
         .fxnTablePtr = &SPICC26X2DMA_fxnTable,
         .object      = &spiCC26X2DMAObjects[CC1352P_MESHNODE_SPI1],
         .hwAttrs     = &spiCC26X2DMAHWAttrs[CC1352P_MESHNODE_SPI1]
    },
#endif
};

const uint_least8_t SPI_count = CC1352P_MESHNODE_SPICOUNT;

