ScanReach/contiki-ng/arch/platform/simplelink/cc13xx-cc26xx/srt/cc1352p/CC1352P_MESHNODE.c
#endif /* TI_SPI_CONF_ENABLE */

/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

#if TI_UART_CONF_ENABLE

UARTCC26XX_Object uartCC26XXObjects[CC1352P_MESHNODE_UARTCOUNT];

uint8_t uartCC26XXRingBuffer[CC1352P_MESHNODE_UARTCOUNT][32];

const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC1352P_MESHNODE_UARTCOUNT] = {
#if TI_UART_CONF_UART0_ENABLE
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC1352P_MESHNODE_UART0_TX,
        .rxPin          = CC1352P_MESHNODE_UART0_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC1352P_MESHNODE_UART0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC1352P_MESHNODE_UART0]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    },
#endif
#if TI_UART_CONF_UART1_ENABLE
    {
        .baseAddr       = UART1_BASE,
        .powerMngrId    = PowerCC26X2_PERIPH_UART1,
        .intNum         = INT_UART1_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC1352P_MESHNODE_UART1_TX,
        .rxPin          = CC1352P_MESHNODE_UART1_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC1352P_MESHNODE_UART1],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC1352P_MESHNODE_UART1]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn = NULL
    },
#endif
};

const UART_Config UART_config[CC1352P_MESHNODE_UARTCOUNT] = {
#if TI_UART_CONF_UART0_ENABLE
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC1352P_MESHNODE_UART0],
        .hwAttrs     = &uartCC26XXHWAttrs[CC1352P_MESHNODE_UART0]
    },
#endif
#if TI_UART_CONF_UART1_ENABLE
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC1352P_MESHNODE_UART1],
        .hwAttrs     = &uartCC26XXHWAttrs[CC1352P_MESHNODE_UART1]
    },
#endif
};

const uint_least8_t UART_count = CC1352P_MESHNODE_UARTCOUNT;

#endif /* TI_UART_CONF_ENABLE */

/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[CC1352P_MESHNODE_UDMACOUNT];

const UDMACC26XX_HWAttrs udmaHWAttrs[CC1352P_MESHNODE_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[CC1352P_MESHNODE_UDMACOUNT] = {
    {
         .object  = &udmaObjects[CC1352P_MESHNODE_UDMA0],
         .hwAttrs = &udmaHWAttrs[CC1352P_MESHNODE_UDMA0]
    },
};



/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogCC26XX.h>

WatchdogCC26XX_Object watchdogCC26XXObjects[CC1352P_MESHNODE_WATCHDOGCOUNT];

const WatchdogCC26XX_HWAttrs watchdogCC26XXHWAttrs[CC1352P_MESHNODE_WATCHDOGCOUNT] = {
    {
        .baseAddr    = WDT_BASE,
        .reloadValue = 1000 /* Reload value in milliseconds */
    },
};

const Watchdog_Config Watchdog_config[CC1352P_MESHNODE_WATCHDOGCOUNT] = {
    {
        .fxnTablePtr = &WatchdogCC26XX_fxnTable,
        .object      = &watchdogCC26XXObjects[CC1352P_MESHNODE_WATCHDOG0],
        .hwAttrs     = &watchdogCC26XXHWAttrs[CC1352P_MESHNODE_WATCHDOG0]
    },
};

const uint_least8_t Watchdog_count = CC1352P_MESHNODE_WATCHDOGCOUNT;

/*
 *  Board-specific initialization function to disable external flash.
 *  This function is defined in the file CC1352P_MESHNODE_fxns.c
 */
extern void Board_initHook(void);

/*
 *  ======== CC1352P_MESHNODE_initGeneral ========
 */
void CC1352P_MESHNODE_initGeneral(void)
{
    Power_init();

    if (PIN_init(BoardGpioInitTable) != PIN_SUCCESS) {
        /* Error with PIN_init */
        while (1);
    }

    /* Perform board-specific initialization */
    Board_initHook();
}

/*
 *  ======== Board_init ========
 */
void Board_init(void)
{
    CC1352P_MESHNODE_initGeneral();
}
